# Q1. 
## Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

Ans:

In [2]:
import pandas as pd

data=[4, 8, 15, 16, 23,42]
print(pd.Series(data))

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. 
## Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

Ans:

In [5]:
my_list=[i for i in range(10)]
print(pd.Series(my_list))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

# Q3. 
## Create a Pandas DataFrame that contains the following data:
|Name|Age|Gender|
|:-:|:-:|:-:|
|Alice|25|Female|
|Bob|30|Female|
|Claire|27|Female|

## Then, print the DataFrame.

Ans:

In [4]:
data={'Name' : ['Alis', 'Bob', 'Claire'],
'Age' : [25,30,27],
'Gender' : ['Female', 'Male', 'Female']}
print(pd.DataFrame(data))

     Name  Age  Gender
0    Alis   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. 
## What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans. :

In Pandas, a DataFrame is a 2-dimensional labeled data structure with columns of potentially different data types, similar to a table in a relational database. Each column in a DataFrame is represented as a Series, which is a 1-dimensional labeled array that can contain any data type.

The main difference between a DataFrame and a Series is that a Series represents a single column of data, while a DataFrame represents a tabular structure with multiple columns and potentially multiple rows of data.

Here's an example to illustrate the difference between a Series and a DataFrame:

In [19]:
import pandas as pd

# create a Series object
fruits = pd.Series(['apple', 'banana', 'orange'])

# create a DataFrame object
data = {'fruits': ['apple', 'banana', 'orange'],
        'quantity': [3, 5, 2],
        'price': [0.5, 0.4, 0.3]}
df = pd.DataFrame(data)

# print the Series and DataFrame
print(fruits, '\n')
print(df)

0     apple
1    banana
2    orange
dtype: object

   fruits  quantity  price
0   apple         3    0.5
1  banana         5    0.4
2  orange         2    0.3

So, in summary, while a Series represents a single column of data with labeled indices, a DataFrame is a tabular data structure with potentially multiple columns and rows of data, where each column is represented as a Series and each row is labeled with an index number.

# Q5. 
## What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Ans. :

Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some of the most commonly used functions:

1. head() and tail(): These functions are used to display the top or bottom few rows of the DataFrame. For example, df.head() will display the first 5 rows of the DataFrame df, while df.tail() will display the last 5 rows.

2. describe(): This function is used to generate various summary statistics of the DataFrame, such as count, mean, standard deviation, minimum, maximum, and quartiles. For example, df.describe() will provide a summary of the statistical properties of the DataFrame df.

3. info(): This function is used to display information about the DataFrame, such as the number of rows, number of columns, data types, and memory usage. For example, df.info() will display information about the DataFrame df.

4. drop(): This function is used to drop a specific column or row from the DataFrame. For example, df.drop('column_name', axis=1) will drop the column with the specified name from the DataFrame df.

5. groupby(): This function is used to group data in the DataFrame by one or more columns and perform some aggregation or transformation on the grouped data. For example, df.groupby('column_name').mean() will group the data in the DataFrame df by the specified column and calculate the mean value for each group.

6. sort_values(): This function is used to sort the rows of the DataFrame by one or more columns in ascending or descending order. For example, df.sort_values('column_name', ascending=False) will sort the rows of the DataFrame df by the specified column in descending order.

In [11]:
name=['Nutan','Gargie','Roshan','anita','kailash','amitav','shital']
age=[30,3,35,23,57,8,61]
education=['M.Tech','Nursary','M.tech', 'Bcom','Primary','B.tech','B.A']
Birth_month=['march','agust','july','Jan','Feb', 'june', 'may']

dataFrame={'Name':name, "Age":age, 'Education':education,'Birth-months':Birth_month}
df=pd.DataFrame(dataFrame)

In [13]:
len(df)

7

In [12]:
df.head()

      Name  Age Education Birth-months
0    Nutan   30    M.Tech        march
1   Gargie    3   Nursary        agust
2   Roshan   35    M.tech         july
3    anita   23      Bcom          Jan
4  kailash   57   Primary          Feb

In [14]:
df.tail()

      Name  Age Education Birth-months
2   Roshan   35    M.tech         july
3    anita   23      Bcom          Jan
4  kailash   57   Primary          Feb
5   amitav    8    B.tech         june
6   shital   61       B.A          may

In [15]:
df.describe()

             Age
count   7.000000
mean   31.000000
std    22.248595
min     3.000000
25%    15.500000
50%    30.000000
75%    46.000000
max    61.000000

In [16]:
df.info

<bound method DataFrame.info of       Name  Age Education Birth-months
0    Nutan   30    M.Tech        march
1   Gargie    3   Nursary        agust
2   Roshan   35    M.tech         july
3    anita   23      Bcom          Jan
4  kailash   57   Primary          Feb
5   amitav    8    B.tech         june
6   shital   61       B.A          may>

# Q6. 
## Which of the following is mutable in nature Series, DataFrame, Panel?

Ans. :

Panel and DataFrame are mutable in nature, while Series Objects are value-mutable but size-immutable objects..

# Q7. 
## Create a DataFrame using multiple Series. Explain with an example.

Ans:

In [7]:
name=['Nutan','Gargie','Roshan']
age=[30,3,35]
education=['M.Tech','Nursary','M.tech']
Birth_month=['march','agust','july']

dataFrame={'Name':name, "Age":age, 'Education':education,'Birth-months':Birth_month}
print(pd.DataFrame(dataFrame))

     Name  Age Education Birth-months
0   Nutan   30    M.Tech        march
1  Gargie    3   Nursary        agust
2  Roshan   35    M.tech         july